In [29]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
df=pd.read_csv("C:/Users/Admin/Desktop/kavya/Social_Network_Ads.csv")
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [31]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [32]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
User ID,400.0,1.569154e+07,71658.321581,15566689.0,15626763.75,15694341.5,15750363.0,15815236.0
Age,400.0,3.765500e+01,10.482877,18.0,29.75,37.0,46.0,60.0
EstimatedSalary,400.0,6.974250e+04,34096.960282,15000.0,43000.00,70000.0,88000.0,150000.0
Purchased,400.0,3.575000e-01,0.479864,0.0,0.00,0.0,1.0,1.0

In [33]:
df.shape

(400, 5)

In [34]:
df.nunique()

User ID            400
Gender               2
Age                 43
EstimatedSalary    117
Purchased            2
dtype: int64

In [35]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [36]:
df['Gender'].replace(to_replace=['Male','Female'],value=[1,2],inplace=True)

In [37]:
df.drop(columns=['User ID'],axis=1,inplace=True)

In [38]:
df.head()

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       2   26            43000          0
3       2   27            57000          0
4       1   19            76000          0

In [39]:
df.tail()

     Gender  Age  EstimatedSalary  Purchased
395       2   46            41000          1
396       1   51            23000          1
397       2   50            20000          1
398       1   36            33000          0
399       2   49            36000          1

In [40]:
cor=df.corr()
cor

                   Gender       Age  EstimatedSalary  Purchased
Gender           1.000000  0.073741         0.060435   0.042469
Age              0.073741  1.000000         0.155238   0.622454
EstimatedSalary  0.060435  0.155238         1.000000   0.362083
Purchased        0.042469  0.622454         0.362083   1.000000

In [51]:
feature_cols=['Gender','Age','EstimatedSalary']
X = df[feature_cols]
y = df['Purchased']

In [59]:
y_test

NameError: name 'y_test' is not defined

In [56]:
from sklearn import tree

tr=tree.DecisionTreeClassifier()
tr.fit(X_train,Y_train)
y_pred=tr.predict(X_test)
y_pred

NameError: name 'X_train' is not defined

In [57]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import classification_report,f1_score
model=DecisionTreeClassifier()
model.fit(x_train,y_train)

NameError: name 'x_train' is not defined

In [55]:
from sklearn import model_selection
kfold=model_selection.KFold(n_splits=10)
tr=tree.DecisionTreeClassifier()
tr.fit(x,Y)
result=model_selection.cross_val_score(tr,x_train,y_train,cv=kfold)
result

NameError: name 'x_train' is not defined